openfoam/source_package/gaganyaan_openfoam_v3_3d_canopy_research/gaganyaan_openfoam_v3_3d_canopy_research/cases/05_main_full_3D/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (20 0 0);
boundaryField
{
    inlet { type fixedValue; value uniform (20 0 0); }
    outlet { type zeroGradient; }
    farField { type slip; }
    canopy { type noSlip; }
}
