openfoam/source_package/gaganyaan_openfoam_v3_3d_canopy_research/gaganyaan_openfoam_v3_3d_canopy_research/cases/05_main_full_3D/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1.788854382;
boundaryField
{
    inlet { type fixedValue; value uniform 1.788854382; }
    outlet { type zeroGradient; }
    farField { type zeroGradient; }
    canopy { type omegaWallFunction; value uniform 1.788854382; }
}
